app/views/books/_form.html.erb

SELECT "libraries".* FROM "libraries"
---
    <%= f.label :library_name %><br>
    <%= f.select :libraries_id, options_for_select(Library.all.map{ |l| [l.name, l.id] }) %>