app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (lower(title) LIKE '%%' and lower(author) LIKE '%%' and lower(subject) LIKE '%%' and published > '2019-09-11' and published < '2019-10-01')
SELECT "books".* FROM "books"
---
  def index
    @books = if (params[:search_by_title] || params[:search_by_author] || params[:search_by_subject] || params[:search_by_published_before] || params[:search_by_published_after])
               if (params[:search_by_published_before]!="" && params[:search_by_published_after]!="")
                 Book.where('lower(title) LIKE ? and lower(author) LIKE ? and lower(subject) LIKE ? and published > ? and published < ?', "%#{params[:search_by_title].downcase}%","%#{params[:search_by_author].downcase}%","%#{params[:search_by_subject].downcase}%","#{params[:search_by_published_before]}","#{params[:search_by_published_after]}")
               elsif (params[:search_by_published_before]!="")
                 Book.where('lower(title) LIKE ? and lower(author) LIKE ? and lower(subject) LIKE ? and published < ?', "%#{params[:search_by_title].downcase}%","%#{params[:search_by_author].downcase}%","%#{params[:search_by_subject].downcase}%","#{params[:search_by_published_before]}")
               elsif (params[:search_by_published_after]!="")
                 Book.where('lower(title) LIKE ? and lower(author) LIKE ? and lower(subject) LIKE ? and published > ?', "%#{params[:search_by_title].downcase}%","%#{params[:search_by_author].downcase}%","%#{params[:search_by_subject].downcase}%" ,"#{params[:search_by_published_after]}")
               else
                 Book.where('lower(title) LIKE ? and lower(author) LIKE ? and lower(subject) LIKE ?', "%#{params[:search_by_title].downcase}%","%#{params[:search_by_author].downcase}%","%#{params[:search_by_subject].downcase}%")
               end
             else
               Book.all

INSERT INTO "books" ("isbn", "title", "author", "language", "published", "edition", "subject", "summary", "special_collection", "created_at", "updated_at", "book_count", "libraries_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    # render plain: params[:book].inspect

    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "amitmandliya.davviet@gmail.com"], ["LIMIT", 1]]
---
  def book_request
    @book = Book.find(params[:id])
    @student = Student.find_by_email(current_user.email)