app/controllers/librarians_controller.rb

SELECT  "librarians".* FROM "librarians" WHERE "librarians"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_librarian
      @librarian = Librarian.find(params[:id])