app/controllers/libraries_controller.rb

  def index
    @libraries = Library.all
---
SELECT "libraries".* FROM "libraries"

  def create
    puts(library_params)
    @library = Library.new(library_params)

    respond_to do |format|
      if @library.save
---
INSERT INTO "libraries" ("name", "university", "location", "max_days", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Hunt"], ["university", "NCSU"], ["location", "Raleigh"], ["max_days", 18], ["created_at", "2019-10-01 18:53:56.470845"], ["updated_at", "2019-10-01 18:53:56.470845"]]

  def update
    respond_to do |format|
      if @library.update(library_params)
---
UPDATE "libraries" SET "location" = $1, "updated_at" = $2 WHERE "libraries"."id" = $3  [["location", "Raleigh - NC"], ["updated_at", "2019-09-30 02:17:59.604694"], ["id", 1]]

    def set_library
      @library = Library.find(params[:id])
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]