app/controllers/librarians_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "cookie@monster.com"], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "sweetcookie@monster.com"], ["updated_at", "2019-10-03 22:38:47.408230"], ["id", 61]]
---
  def update
    authorize Librarian
    @user = User.find_by_email(@librarian.email)
    respond_to do |format|
      if @librarian.update(librarian_params)