app/controllers/librarians_controller.rb

  def index
    # @user = Librarian.find(params[:id])
    # unless current_user.librarian?
    #   unless @user == current_user
    #     redirect_to :back, :alert => "Access denied!"
    #   end
    # end
    # @users = Librarian.all
    # @my_models = policy_Scope(MyModel)
    @librarians = policy_scope(Librarian)
    @librarians = Librarian.all

    @library_dict = {}
    @libs = Library.all

    @libs.each do |l|
---
SELECT "librarians".* FROM "librarians"
SELECT "libraries".* FROM "libraries"

  def create
    authorize Librarian
    @librarian = Librarian.new(librarian_params)

    # create user entry here
    puts librarian_params

    respond_to do |format|
      if @librarian.save
---
INSERT INTO "librarians" ("email", "name", "created_at", "updated_at", "libraries_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "hello@hello.com"], ["name", "Hello Hello Libs"], ["created_at", "2019-10-03 23:11:16.525757"], ["updated_at", "2019-10-03 23:11:16.525757"], ["libraries_id", 1]]

  def update
    authorize Librarian
    respond_to do |format|
      if @librarian.update(librarian_params)
---
UPDATE "librarians" SET "email" = $1, "libraries_id" = $2, "updated_at" = $3 WHERE "librarians"."id" = $4  [["email", "sweetcookie@monster.com"], ["libraries_id", 1], ["updated_at", "2019-10-03 22:38:47.303448"], ["id", 15]]

  def list_special_book_request
    authorize Librarian
    query = "select * from book_request"
    #@book_request = BookRequest.find(query)
    @book_request = BookRequest.all.where(is_approved: 'false')
---
SELECT "book_request".* FROM "book_request" WHERE "book_request"."is_approved" = $1  [["is_approved", false]]

  def approve_book_request
    authorize Librarian
    @book_request = BookRequest.find(params[:id])
   # query = "update book_request"
    @book_request.update_attribute(:is_approved,"true")
---
SELECT  "book_request".* FROM "book_request" WHERE "book_request"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "book_request" SET "is_approved" = $1 WHERE "book_request"."id" = $2  [["is_approved", true], ["id", 4]]

    def set_librarian
      @librarian = Librarian.find(params[:id])
---
SELECT  "librarians".* FROM "librarians" WHERE "librarians"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]