app/controllers/registrations_controller.rb

  def create

    # @user = User.new(sign_up_params)
    # @user.save
    # respond_to do |format|
    if sign_up_params[:role]=='user'
        @stud = Student.find_by_email(sign_up_params[:email])
        if @stud.nil?
          @stud = Student.new(email: sign_up_params[:email], name: params[:user][:student][:name],
                              password: sign_up_params[:password], education: params[:user][:student][:education],
                              university: params[:user][:student][:university], max_books: params[:user][:student][:max_books])
          @stud.save
        else
          # @stud.update(student_signup_params)
          # format.html { redirect_to students_path, notice: 'Student was successfully created.' }
          # format.json { render :show, status: :created, location: @student }
        end
      elsif sign_up_params[:role]=='librarian'
        @lib = Librarian.find_by_email(sign_up_params[:email])
        if(@lib.nil?)
          @lib = Librarian.new(email: sign_up_params[:email], name: params[:user][:librarian][:name],
                               password: sign_up_params[:password], libraries_id: params[:user][:librarian][:libraries_id])
          @lib.save
---
SELECT  "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "student11@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "a@g"], ["encrypted_password", "$2a$11$2kG7Y4U7ptm2GRExIZU9Qur5U5ot57.Uya2d5vGZ8.PxsZ6VMDarO"], ["created_at", "2019-09-26 16:45:36.130408"], ["updated_at", "2019-09-26 16:45:36.130408"]]
INSERT INTO "students" ("email", "name", "password", "education", "university", "max_books", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "librarians".* FROM "librarians" WHERE "librarians"."email" = $1 LIMIT $2  [["email", "lib@lib.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "role") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "librarians" ("email", "name", "password", "created_at", "updated_at", "libraries_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "lib@lib.com"], ["name", "Maharshi the librarian"], ["password", "1235"], ["created_at", "2019-10-03 22:19:00.164589"], ["updated_at", "2019-10-03 22:19:00.164589"], ["libraries_id", 2]]