app/controllers/students_controller.rb

INSERT INTO "students" ("email", "name", "password", "university", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "student@gmail.com"], ["name", "Amit"], ["password", "123456"], ["university", "NCSUff"], ["created_at", "2019-10-01 23:20:12.288734"], ["updated_at", "2019-10-01 23:20:12.288734"]]
---
  def create
    authorize Student
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

UPDATE "students" SET "name" = $1, "password" = $2, "education" = $3, "university" = $4, "updated_at" = $5 WHERE "students"."id" = $6  [["name", "Amit Mandliya"], ["password", "123456"], ["education", "Masters"], ["university", "NCSU"], ["updated_at", "2019-10-01 17:54:59.536808"], ["id", 1]]
---
  def update
    authorize Student
    respond_to do |format|
      if @student.update(student_params)

DELETE FROM "students" WHERE "students"."id" = $1  [["id", 2]]
---
  def destroy
    authorize Student
    @student.destroy