app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "librarians".* FROM "librarians" WHERE "librarians"."email" = $1 LIMIT $2  [["email", "amit@mit.com"], ["LIMIT", 1]]
INSERT INTO "librarians" ("email", "password", "created_at", "updated_at", "libraries_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "amit@gmail.com"], ["LIMIT", 1]]
INSERT INTO "students" ("email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def copy_data
    if self.librarian?
      # if not @user = Librarian.find(self.id)
      @user = User.find(self.id)
      if Librarian.find_by_email(self.email).nil?
        @lib = Librarian.new(email: self.email, password: self.encrypted_password, libraries_id: 1)
        @lib.save
        #   flash[:success] = "Successfully saved data to Librarian model"
        # redirect_to librarians_path

        # else
        #   flash[:error] = "Could not create record"
        # end
      end

        # @user = Librarian.find(self.id)
        # if (nil == @user)
        #   @lib = Librarian.create(email: self.email, name:self.email, password: self.encrypted_password, users_id: self.id)
        #   @lib.save
        # else
        #   @lib = Librarian.create(email: self.email, name:self.email, password: self.encrypted_password, users_id: self.id)
        #   @lib.save
        # end
      #
    elsif self.user?
      # @user = User.find(self.id)
      if Student.find_by_email(self.email).nil?
        @stud = Student.new(email: self.email, password: self.encrypted_password)
        @stud.save