app/views/librarians/_form.html.erb

SELECT "libraries".* FROM "libraries"
---
    <%= form.label :library_name %><br>
    <%= form.select :libraries_id, options_for_select(Library.all.map{ |l| [l.name, l.id] })%>