app/views/librarians/list_special_book_request.html.erb

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
        <td><%= book_request['books_id'] %></td>
        <td><%= Book.find_by_id(book_request['books_id']).title %></td>
        <td><%= Book.find_by_id(book_request['books_id']).author %></td>
        <td><%= Student.find_by_id(book_request['students_id']).id %></td>
        <td><%= Student.find_by_id(book_request['students_id']).name %></td>